app/Models/Product_model.php

SELECT *
FROM `product`
SELECT *
FROM `product`
WHERE `product_id` = '1'
---
	public function getProduct($id = false){
		if($id === false){
			return $this->findAll();
		}else{
			return $this->getWhere(['product_id' => $id]);